// Напишите программу, которая на вход принимает число
// и выдает его квадрат 

int value = 4;
int result = value * value;
Console.WriteLine(result);


